# Dropping Rows And Columns In pandas Dataframe
### Import Modules

In [1]:
import pandas as pd

### Create a dataframe

In [3]:
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

             name  reports  year
Cochice     Jason        4  2012
Pima        Molly       24  2012
Santa Cruz   Tina       31  2013
Maricopa     Jake        2  2014
Yuma          Amy        3  2014

### Drop an observation (row)

In [5]:
df.drop(['Cochice','Pima'])

            name  reports  year
Santa Cruz  Tina       31  2013
Maricopa    Jake        2  2014
Yuma         Amy        3  2014

### Drop a variable (column)

In [7]:
df.drop('reports', axis=1)

             name  year
Cochice     Jason  2012
Pima        Molly  2012
Santa Cruz   Tina  2013
Maricopa     Jake  2014
Yuma          Amy  2014

### Drop a row if it contains a certain value (in this case, "Tina")

In [8]:
df[df.name != 'Tina']

           name  reports  year
Cochice   Jason        4  2012
Pima      Molly       24  2012
Maricopa   Jake        2  2014
Yuma        Amy        3  2014

### Drop a row by row number (in this case, row 3)

In [9]:
df.drop(df.index[2])

           name  reports  year
Cochice   Jason        4  2012
Pima      Molly       24  2012
Maricopa   Jake        2  2014
Yuma        Amy        3  2014

can be extended to dropping a range

In [10]:
df.drop(df.index[[2,3]])

          name  reports  year
Cochice  Jason        4  2012
Pima     Molly       24  2012
Yuma       Amy        3  2014

or dropping relative to the end of the DF.

In [11]:
df.drop(df.index[-2])

             name  reports  year
Cochice     Jason        4  2012
Pima        Molly       24  2012
Santa Cruz   Tina       31  2013
Yuma          Amy        3  2014

you can select ranges relative to the top or drop relative to the bottom of the DF as well.

In [12]:
df[:3]

             name  reports  year
Cochice     Jason        4  2012
Pima        Molly       24  2012
Santa Cruz   Tina       31  2013

In [13]:
df[:-3]

          name  reports  year
Cochice  Jason        4  2012
Pima     Molly       24  2012

Source: https://chrisalbon.com/python/pandas_dropping_column_and_rows.html